Clickfix nslookup Abuse Detection

A recently observed social engineering technique involves attackers distributing phishing emails that redirect victims to a counterfeit CAPTCHA verification page. 
The fake page is designed to appear legitimate, but its purpose is to deceive users into copying, pasting, and executing malicious commands supplied by the attacker.

Below is the KQL used for Detection:

DeviceProcessEvents
| where InitiatingProcessCommandLine has "nslookup" and InitiatingProcessCommandLine has "findstr"
| extend AttackerIP = extract("([[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}",1, InitiatingProcessCommandLine)
| where isnotempty(AttackerIP) and not(ipv4_is_private(AttackerIP))
| distinct DeviceName, Timestamp, InitiatingProcessAccountName, InitiatingProcessCommandLine, ProcessCommandLine
