Criticality assets with command line Credentials

The query monitors commands like net, wmic, schtasks, psexec, cmdkey, pscp, and winscp, which are commonly used for scripting and command execution, 
this query is designed to detect the usernames and passwords used on command line and these are indications of credential dumping on other hand this is 
also used to detect remote execution, file transfers and lateral moment tequnics.

 DeviceEvents
 | where Timestamp > ago(30d)
 | where InitiatingProcessCommandLine has_any('net', 'wmic', 'schtasks', 'psexec', 'cmdkey', 'pscp', 'winscp')
 | where InitiatingProcessCommandLine matches regex '(?:(?:(?:-p)|(?:-password)|(?:-passwd)|(?:--password)|(?:--passwd)|(?:/P)|(?:/PASSWD)(?:\\s+|\\:)(?<password>(?:"((?:\\\\.|[^"\\\\])*)")|(?:[^\\s"]+)))' or InitiatingProcessCommandLine matches regex '(?:(?:(?:-u)|(?:-user)|(?:-username)|(?:--user)|(?:--username)|(?:/u)|(?:/USER)|(?:/USERNAME))(?:\\s+|\\:)(?<username>(?:"((?:\\\\.|[^"\\\\])*)")|(?:[^\\s"]+)))'
 | distinct DeviceName, FileName
